## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault.current_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "current_key" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "vj-rcm-dev-kv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "vj-rcm-dev-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # data.azurerm_key_vault_secret.current_adls_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "current_adls_secret" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "vj-adls-access-key-dev"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_data_factory_linked_service_data_lake_storage_gen2.rcm_adls_ls will be updated in-place
  ~ resource "azurerm_data_factory_linked_service_data_lake_storage_gen2" "rcm_adls_ls" {
        id                    = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.DataFactory/factories/vj-rcm-dev-adf/linkedservices/vj-rcm-dev-adls-ls"
        name                  = "vj-rcm-dev-adls-ls"
      ~ storage_account_key   = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # azurerm_data_factory_pipeline.vj_rcm_active_tables_pl will be destroyed
  # (because azurerm_data_factory_pipeline.vj_rcm_active_tables_pl is not in configuration)
  - resource "azurerm_data_factory_pipeline" "vj_rcm_active_tables_pl" {
      - activities_json                = jsonencode(
            [
              - {
                  - dependsOn      = []
                  - name           = "config_emr_lkp"
                  - policy         = {
                      - retry                  = 0
                      - retryIntervalInSeconds = 30
                      - secureInput            = false
                      - secureOutput           = false
                      - timeout                = "0.12:00:00"
                    }
                  - type           = "Lookup"
                  - typeProperties = {
                      - dataset      = {
                          - parameters    = {
                              - container = "configs"
                              - file_name = "load_config.csv"
                              - folder    = "emr"
                            }
                          - referenceName = "vj_rcm_dev_generic_flatfile_ds"
                          - type          = "DatasetReference"
                        }
                      - firstRowOnly = false
                      - source       = {
                          - formatSettings = {
                              - compressionProperties = null
                              - type                  = "DelimitedTextReadSettings"
                            }
                          - storeSettings  = {
                              - enablePartitionDiscovery = false
                              - recursive                = true
                              - type                     = "AzureBlobFSReadSettings"
                            }
                          - type           = "DelimitedTextSource"
                        }
                    }
                  - userProperties = []
                },
              - {
                  - dependsOn      = [
                      - {
                          - activity             = "config_emr_lkp"
                          - dependencyConditions = [
                              - "Succeeded",
                            ]
                        },
                    ]
                  - description    = ""
                  - name           = "Iter_Tables"
                  - type           = "ForEach"
                  - typeProperties = {
                      - activities   = [
                          - {
                              - dependsOn      = []
                              - name           = "IF_Active"
                              - type           = "IfCondition"
                              - typeProperties = {
                                  - expression       = {
                                      - type  = "Expression"
                                      - value = "@equals(item().is_active,'1')"
                                    }
                                  - ifTrueActivities = [
                                      - {
                                          - dependsOn      = []
                                          - name           = "Append_Tables"
                                          - type           = "AppendVariable"
                                          - typeProperties = {
                                              - value        = {
                                                  - type  = "Expression"
                                                  - value = "@item()"
                                                }
                                              - variableName = "items"
                                            }
                                          - userProperties = []
                                        },
                                    ]
                                }
                              - userProperties = []
                            },
                        ]
                      - isSequential = true
                      - items        = {
                          - type  = "Expression"
                          - value = "@activity('config_emr_lkp').output.value"
                        }
                    }
                  - userProperties = []
                },
              - {
                  - dependsOn      = [
                      - {
                          - activity             = "Iter_Tables"
                          - dependencyConditions = [
                              - "Succeeded",
                            ]
                        },
                    ]
                  - name           = "Collect_tables"
                  - policy         = {
                      - secureInput  = false
                      - secureOutput = false
                    }
                  - type           = "SetVariable"
                  - typeProperties = {
                      - setSystemVariable = true
                      - value             = [
                          - {
                              - key   = "item"
                              - value = {
                                  - content = "@variables('items')"
                                  - type    = "Expression"
                                }
                            },
                        ]
                      - variableName      = "pipelineReturnValue"
                    }
                  - userProperties = []
                },
            ]
        ) -> null
      - concurrency                    = 0 -> null
      - data_factory_id                = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.DataFactory/factories/vj-rcm-dev-adf" -> null
      - id                             = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.DataFactory/factories/vj-rcm-dev-adf/pipelines/pl_active_tables" -> null
      - name                           = "pl_active_tables" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault.rcm_kv will be updated in-place
  ~ resource "azurerm_key_vault" "rcm_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Decrypt",
                    "Encrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Verify",
                    "Sign",
                    "Purge",
                    "Release",
                    "Rotate",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                ]
                object_id               = "68469a57-c1fd-46d1-ba9c-c42616f8ea86"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Purge",
                ]
                storage_permissions     = [
                    "Backup",
                    "Delete",
                    "DeleteSAS",
                    "Get",
                    "GetSAS",
                    "List",
                    "ListSAS",
                    "Purge",
                    "Recover",
                    "RegenerateKey",
                    "Restore",
                    "Set",
                    "SetSAS",
                    "Update",
                ]
                tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                ]
              - object_id               = "6f0da0b0-27bb-4601-a4ed-81d234b09d39"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                ]
              - object_id               = "d4efe806-c98b-46f5-bb54-6a7d1276b11a"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
        ]
        id                              = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
        name                            = "vj-rcm-dev-kv"
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_access_policy.rcm-adls-principal will be created
  + resource "azurerm_key_vault_access_policy" "rcm-adls-principal" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "UnwrapKey",
          + "WrapKey",
        ]
      + key_vault_id       = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
      + object_id          = "6db93c42-e026-4dcc-bf15-01824ab47004"
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>